# Action Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCImportOptions..::..Action Property
IFCImportOptions Class See Also
---
The action of the import.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IFCImportAction Action { get; set; }
```

Visual Basic
---
```text
Public Property Action As IFCImportAction
	Get
	Set
```

Visual C++
---
```text
public:
property IFCImportAction Action {
	IFCImportAction get ();
	void set (IFCImportAction value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace